In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({
    "A":["foo","bar","foo","bar","foo","bar","foo","foo"],
    "B":["one","one","two","three","two","two","one","three"],
    "C":np.random.randn(8),
    "D":np.random.randn(8),
})

In [3]:
df

     A      B         C         D
0  foo    one  1.014478  1.091711
1  bar    one -1.194962  0.358074
2  foo    two  2.381837 -0.057027
3  bar  three  0.953335 -0.489899
4  foo    two -0.510163 -0.682090
5  bar    two  1.259668 -0.643042
6  foo    one  0.381795 -0.691808
7  foo  three -0.455432 -3.450820

In [4]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar  1.018041 -0.774867
foo  2.812515 -3.790035

In [5]:
df.groupby(["A","B"]).sum()

                  C         D
A   B
bar one   -1.194962  0.358074
    three  0.953335 -0.489899
    two    1.259668 -0.643042
foo one    1.396273  0.399903
    three -0.455432 -3.450820
    two    1.871673 -0.739117

In [6]:
df1 = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)

In [7]:
df1

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [8]:
grouped=df1.groupby("class")
grouped

In [9]:
df1.groupby("order",axis="columns")

In [10]:
df1.groupby(["class","order"])

In [11]:
df

     A      B         C         D
0  foo    one  1.014478  1.091711
1  bar    one -1.194962  0.358074
2  foo    two  2.381837 -0.057027
3  bar  three  0.953335 -0.489899
4  foo    two -0.510163 -0.682090
5  bar    two  1.259668 -0.643042
6  foo    one  0.381795 -0.691808
7  foo  three -0.455432 -3.450820

In [13]:
grouped=df.groupby("A")
grouped

In [14]:
grouped = df.groupby(["A", "B"])
grouped

In [17]:
df2=df.set_index(["A","B"])

In [18]:
grouped=df2.groupby(level=df2.index.names.difference(["B"]))

In [19]:
grouped

In [20]:
grouped.sum()

            C         D
A
bar  1.018041 -0.774867
foo  2.812515 -3.790035

In [21]:
def get_letter_type(letter):
    if letter.lower() in "aeiou":
        return "vowel"
    else:
        return "consonant"
    
grouped=df.groupby(get_letter_type,axis=1)

In [22]:
grouped

In [24]:
lst=[1,2,3,1,2,3]
s=pd.Series([1,2,3,10,20,30],lst)

grouped=s.groupby(level=0)
grouped

In [25]:
grouped.first()

1    1
2    2
3    3
dtype: int64

In [26]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [27]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [28]:
df2 = pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4]})
df2.groupby(["X"]).sum()

   Y
X
A  7
B  3

In [29]:
df2.groupby(["X"],sort=False).sum()

   Y
X
B  3
A  7

# GroupBy dropna

In [30]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df_dropna=pd.DataFrame(df_list,columns=["a","b","c"])

In [31]:
df_dropna

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [33]:
df_dropna.groupby(by=["b"],dropna=True).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [34]:
df_dropna.groupby(by=["b"],dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [35]:
df.groupby("A").groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [36]:
df.groupby(get_letter_type, axis=1).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [37]:
grouped=df.groupby(["A","B"])

In [38]:
grouped.groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

In [39]:
len(grouped)

6

In [40]:
df

     A      B         C         D
0  foo    one  1.014478  1.091711
1  bar    one -1.194962  0.358074
2  foo    two  2.381837 -0.057027
3  bar  three  0.953335 -0.489899
4  foo    two -0.510163 -0.682090
5  bar    two  1.259668 -0.643042
6  foo    one  0.381795 -0.691808
7  foo  three -0.455432 -3.450820